/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Não foi possível concluir a operação.";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Ocorreu um erro desconhecido (%d)."; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Não é possível completar acção";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Volte a tentar mais tarde.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Não é possível gravar";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Tente voltar a gravar.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Não é possível gravar";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Interrompa outras operações que usem este dispositivo (%@) e volte a tentar."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Não é possível gravar";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Tente voltar a gravar.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Gravação interrompida";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Tente voltar a gravar.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Operação interrompida";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Não dispõe de espaço suficiente para continuar a escrever. Para libertar espaço, apague alguns vídeos ou fotografias.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Gravação interrompida";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Tente voltar a gravar.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Gravação interrompida";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Tente voltar a gravar.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Gravação interrompida";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "A gravação atingiu a duração máxima permitida."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Gravação interrompida";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "A gravação atingiu o tamanho de ficheiro máximo permitido."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Gravação interrompida";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Interrompa outras operações que usem o dispositivo de gravação e volte a tentar.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Gravação interrompida";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "A gravação atingiu a duração máxima permitida."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Não é possível gravar";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Tente voltar a gravar.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Não é possível usar %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Interrompa outras operações que usem este dispositivo (%@) e volte a tentar."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Não é possível usar %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Interrompa outras operações que usem este dispositivo (%@) e volte a tentar."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Gravação interrompida";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Interrompa outras operações que usem o dispositivo de gravação e volte a tentar.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "Não foi possível ligar a lanterna.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "Tente ligar a um nível menos elevado.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Não é possível completar acção";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Volte a tentar mais tarde.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Não é possível completar exportação";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Tente voltar a exportar.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Não foi possível descodificar";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Os dados do conteúdo multimédia não puderam ser descodificados. É possível que estejam danificados.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Não é possível abrir";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Este formato de multimédia não é suportado.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Não é possível guardar";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Tente voltar a guardar.";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "Não é possível escrever ficheiro de saída de dados";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "Altere a extensão da saída de dados o e volte a tentar.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Não é possível abrir";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Não é possível usar este conteúdo.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Não é possível abrir";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Não é possível usar este conteúdo.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Não é possível abrir";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Não é possível usar este conteúdo.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Não é possível abrir";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Não é possível usar este conteúdo.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Não é possível abrir";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Este formato de multimédia não é suportado.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Não é possível abrir";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "É possível que o conteúdo esteja danificado.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Não é possível tirar fotografia";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Volte a tentar tirar a fotografia.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Operação interrompida";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Esta operação não é suportada com conteúdo protegido."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Não é possível abrir";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Este conteúdo não é permitido."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Não é possível abrir";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Esta aplicação não está autorizada a reproduzir este ficheiro."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Não é possível abrir";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Não é possível usar este conteúdo.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Não foi possível descodificar";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Não foi encontrado o descodificador para este conteúdo.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Não foi possível codificar";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Não foi encontrado o codificador para este conteúdo.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Não foi possível descodificar";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "O descodificador para este conteúdo está ocupado.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Interrompa outras acções que descodifiquem conteúdo e volte a tentar.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Não foi possível codificar";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "O codificador para este conteúdo está ocupado.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Interrompa outras acções que codifiquem conteúdo e volte a tentar.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Não é possível usar %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "Este dispositivo (%@) não pode ser usado por uma aplicação aberta em segundo plano."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Operação interrompida";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Esta operação não é suportada com este tipo de conteúdo.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Operação interrompida";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Não foi possível compor o vídeo de acordo com as instruções.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Não é possível abrir";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Não é possível usar este conteúdo.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Operação interrompida";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Não foi possível usar o ficheiro de cache no URL de destino de descarga.";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "Operação interrompida";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "O ficheiro tem uma checksum que não é válida.";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "Operação interrompida";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "Interrompa as outras operações e volte a tentar.";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "Não é possível abrir";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "Não é possível usar o conteúdo neste dispositivo.";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "Operação interrompida";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "É possível que o conteúdo esteja danificado.";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "Operação interrompida";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "O servidor não está correctamente configurado.";
